# 1. اختيار الصورة الأساسية: سنبدأ بنسخة بايثون رسمية خفيفة الوزن
FROM python:3.10-slim

# 2. تحديد مجلد العمل داخل الحاوية (أي أمر سيُنفذ سيكون داخل هذا المجلد)
WORKDIR /app

# 3. نسخ ملف المكتبات أولاً من جهازك إلى داخل الحاوية
COPY requirements.txt .

# 4. تثبيت المكتبات المطلوبة داخل الحاوية بدون تحميل ملفات زائدة
RUN pip install --no-cache-dir -r requirements.txt

# 5. نسخ باقي ملفات المشروع (مثل app.py) إلى داخل الحاوية
COPY . .

# 6. فتح المنفذ 5000 في الحاوية ليتمكن النظام الخارجي من الاتصال بالتطبيق
EXPOSE 5555

# 7. الأمر النهائي الذي سيتم تشغيله تلقائياً بمجرد تشغيل الحاوية
CMD ["python", "app.py"]
